openfoam-3d-flow-study/subsonic/0/alphat
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	alphat;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -1 0 0 0 0];
internalField	uniform 0;
boundaryField
{
	outlet
	{
		type	calculated;
		value	uniform 0;
	}
	inlet
	{
		type	calculated;
		value	uniform 0;
	}
	sym1
	{
		type	symmetry;
	}
	sym2
	{
		type	symmetry;
	}
	walls
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0;
		Prt	0.85;
	}
	noseCone
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0;
		Prt	0.85;
	}
}
