openfoam-3d-flow-study/subsonic/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.5 -0.5 -0.5)
	(0.5 -0.5 -0.5)
	(0.5 0.5 -0.5)
	(-0.5 0.5 -0.5)
	(-0.5 -0.5 0.5)
	(0.5 -0.5 0.5)
	(0.5 0.5 0.5)
	(-0.5 0.5 0.5)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);
edges	();
boundary	(
	boundaries
	{
		type	patch;
		faces	(
			(1 5 4 0)
			(2 6 5 1)
			(3 7 6 2)
			(0 4 7 3)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);
